object MessageTexts {
    const val CHECKIN = "Зачекінитися"
    const val WHOAMI_CURRENT = "Поточні зустрічі"
    const val WHOAMI_NEW_STUDENTS = "Нові студенти"
    const val WHOAMI_RESOURCES = "Корисні матеріали"
    const val WHOAMI_SHEET = "Гугл таблиця"
    const val WHOAMI_STAFF = "Особистий кабінет"
    const val WHOAMI_NOTIFICATIONS_ON = "Увімкнути сповіщення"
    const val WHOAMI_NOTIFICATIONS_OFF = "Вимкнути сповіщення"
    const val WHOAMI = "ЯХТО"
    const val SUBSCRIBE = "Підписатися на новини"
    const val FEEDBACK = "Залишити відгук"
    const val DATABASE = "База даних"
    const val DB_COUNT = "Кількість студентів в Гугл таблиці"
    const val DB_DOWNLOAD = "Завантажити з Гугл таблиці у БД"
    const val DB_UPLOAD = "Завантажити з БД до Гугл таблиці"
    const val DOWNLOADED = "Успішно завантажено %d студентів з Гугл таблиці у внутрішню БД"
    const val UPLOADED = "Успішно завантажено %d студентів з внутрішньої БД до Гугл таблиці"
    const val COUNTED = "В Гугл таблиці %d студентів"
    const val STATS_CHECKINS = "За день чекінів:"
    const val STATS_NEW_STDS = "Нові студенти:"
    val GREETING = """
        Вітаємо тебе в студентському просторі Campus Ukraine!
        Це сучасний, комфортний, безкоштовний простір для твого навчання та відпочинку, для самостійної роботи або підготовки проєктів з друзями.
        
        З Пн по Пт ми чекаємо тебе на free space з 14:00 до 21:30 – приходь навчатись, займатись своїми справами, грати в настільні ігри.
        Вечорами тут проходять різні заходи.
        
        Ми - спільнота студентів, яка надихає!
        
        Якщо ти у нас вперше – заповни, будь ласка, анкету та ознайомся з правилами використання простору.
    """.trimIndent()
    const val ASK_FIRST_NAME = "Як тебе звуть? (тільки ім'я, без фамілії)"
    const val ASK_FIRST_NAME_AGAIN = "Тільки ім'я, кирилицею, без фамілії"
    const val ASK_LAST_NAME = "А яке в тебе прізвище?"
    const val ASK_LAST_NAME_AGAIN = "Тільки прізвище, кирилицею"
    const val ASK_UNIVERSITY = "Приємно познайомитися, %s!\nЗ якого ти університету?\n(обери зі списку або напиши)"
    const val ASK_YEAR_STUDY = "А нагадай який ти курс?"
    const val WRONG_YEAR_STUDY = "Просто число від 1 до 6 включно"
    const val ASK_STUD_PRO = "А як ти дізнався про Student Prostir?\n(обери зі списку або напиши)"
    const val ASK_RULES = "І наостанок, будь-ласка, ознайомся з правилами перебування в Student Prostir"
    val RULES = """
            Загальні правила перебування в Student Prostir
            
            #1 При відвідуванні Free Spaсe обов’язково зареєструватися (заповнити анкету)
            
            #2 Слідкуй за чистотою і не забудь прибрати після себе. Використаний посуд став в посудомийну машину.
            
            #3 Поважай себе та інших. Не створюй перешкоди і незручності іншим під час Free Spaсe, давай не будемо шуміти та нецензурно висловлюватися.
            
            #4 Потрібно класти речі на свої місця (посуд, ігри).
            
            #5 Не залишайте особисті речі без нагляду.
            
            #6 Help yourself. Можна робити собі каву\чай та користуватись кухнею з дозволу адміністратора.
            
            #7 Не можна заходити в кімнату в конференц залі і комірчини з наліпками Staff Only.
            
            #8 В туалеті дотримуватися чистоти, засоби особистої гігієни необхідно викидати в смітник.
            
            #9 Забороняється: палити в приміщенні та прилеглій території (в тому числі і електронні сигарети). Перебувати в стані алкогольного або наркотичного сп'яніння; вживати алкогольні напої, наркотичні, інші п'янкі речовини.
            
            #10 Збитки і шкоду, заподіяні внаслідок дії користувачів, відшкодовуються в повному обсязі :) 
    """.trimIndent()
    const val AGREE = "Я ознайомлений та погоджуюсь"
    const val FORCE_AGREE = "Правила є правила, перед тим як користуватися Student Prostir ти маєш ознайомитися і погодитися з ними"
    const val FINISH_REGISTRATION = "Це все, дякую тобі, тепер в майбутньому тобі достатньо буде натиснути \"Зачекінитися\"\nWi-Fi - Campus Ukraine\nPassword - StudentProstir2018"
    const val THANKS = "Дякую, %s, ти успішно зачекінився! :)"
    const val ALREADY_CHECKED_IN = "Схоже ти вже сьогодні чекінився.."
    const val SUBSCRIBED = "Дякую, ти знайдеш наш телеграм канал за наступним посиланням"
    const val WANNA_FEEDBACK = "Супер, тепер просто напиши або запитай про щось"
    const val RESULT_FEEDBACK = "Дякую, зворотній зв'язок зі студентами допомагає нам вдосконалюватися!"
    const val EMPTY_WHOAMI_STUDENTS = "Не знайдено поточних яхтошників чи запланових зустрічей за останні 3 тижні"
    const val RETURN = "Назад"
    const val ENTER_DATE = "Заповнити дату зустрічі"
    val WHO_AM_I_AD = """
            Проект ЯХТО
            
            Відбувається вже більше 5 років у різних Campus-містах.
            
            Хто ти? Студент, син, столяр третього розряду, професор, моряк, технар чи гуманітарій? Це умовності. Це не відповіді на запитання «хто я?»
            
            Твоя справжня ідентичність значно глибша. Саме вона визначає твої мрії, оточення, самооцінку.
            
            Для чого ти живеш? Куди рухаєшся? В чому твоя цінність? Де заховані піастри? Як культура довкола впливає на тебе? Що таке ідентичність?
            Ці питання гаряче обговорюють на проекті ЯХТО, що проводиться студентами для студентів.
            
            Щоб ти міг знайти себе, ми створили цей волонтерський проект. ЯХТО потребує сміливості й мужності, адже ти справді можеш зустрітися із самим собою.
            
            Індивідуальні коуч-зустрічі із волонтерами та євротести – це у нас.
            
            Зрозумій свої мотиви, дізнайся своє покликання та орієнтири для прийняття рішень. Познайомся зі студентами, які живуть свідомо й активно із ЯХТО!
    """.trimIndent()
    const val WHO_AM_I_MORE_INFO_TEXT = "Більше інформації"
    const val WHO_AM_I_MORE_INFO_LINK = "http://kyivcampus.tilda.ws/whoiam"
    const val WHO_AM_I_REGISTRATION_TEXT = "Реєстрація"
    const val WHO_AM_I_REGISTRATION_LINK = "https://docs.google.com/forms/d/e/1FAIpQLSfWfOBE2w3eFYX250FG4ByQAEMYf540dWMZ1UVycLqbY2lwgg/viewform"
    const val WHO_AM_I_STAFF_LINK = "https://docs.google.com/spreadsheets/d/1ayTBVMtzSMws3VtY4fAG0CSLOkqyzan4awkKulLvejE"
    const val INVITE_CAMPUS_CHANNEL_TEXT = "Підписатися"
    const val INVITE_CAMPUS_CHANNEL_LINK = "https://t.me/joinchat/AAAAAEw7Hu59D_KNUemEnQ"
    const val DEFAULT = "Список доступних команд"
    const val SUCCESS = "Успішно, дякую, класно мати тебе в команді :)"
    val WISHES = listOf("Приємного спілкування!", "Успіхів!", "Гарного вечора!", "Гарно вам посидіти!", "Приємного вечора!", "Цікавого спілкування!")
}
